In [1]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
mydata = np.random.randn(4,3)

In [3]:
mydata

array([[ 1.99930303,  0.42232724,  0.07527526],
       [ 0.39508586, -1.10240501, -0.589537  ],
       [ 0.62025845, -0.99498051, -0.97568298],
       [ 0.76240039, -0.47240146,  0.61020007]])

In [4]:
list("ABCDE")

['A', 'B', 'C', 'D', 'E']

In [5]:
#  字串與 list轉換：list(字串)
list("甲乙丙丁")

['甲', '乙', '丙', '丁']

In [6]:
# 自訂dataframe：新dataframe = pd.DataFrame(array,colunms=項目list)
df1 = pd.DataFrame(mydata,columns=list("ABC"))

In [7]:
df1

          A         B         C
0  1.999303  0.422327  0.075275
1  0.395086 -1.102405 -0.589537
2  0.620258 -0.994981 -0.975683
3  0.762400 -0.472401  0.610200

In [8]:
df2 = pd.DataFrame(np.random.randn(3,3),columns=list("ABC"))

In [9]:
df2

          A         B         C
0  0.932062  0.481490  1.437469
1  0.324137 -0.065409  0.293048
2 -0.677609  0.048074  0.791621

In [10]:
# 合併 dataframe：新 dataframe = pd.concat(dataframe的list,axis=(0或1))
# axis控制合併的方向,0是上下(列方向),1是左右(行方向)
 
df3 = pd.concat([df1,df2], axis=0)

In [11]:
df3

          A         B         C
0  1.999303  0.422327  0.075275
1  0.395086 -1.102405 -0.589537
2  0.620258 -0.994981 -0.975683
3  0.762400 -0.472401  0.610200
0  0.932062  0.481490  1.437469
1  0.324137 -0.065409  0.293048
2 -0.677609  0.048074  0.791621

In [12]:
# 更改 daraframe的 index：dataframe名稱.index =要給的 list
df3.index = range(7)

In [13]:
df3

          A         B         C
0  1.999303  0.422327  0.075275
1  0.395086 -1.102405 -0.589537
2  0.620258 -0.994981 -0.975683
3  0.762400 -0.472401  0.610200
4  0.932062  0.481490  1.437469
5  0.324137 -0.065409  0.293048
6 -0.677609  0.048074  0.791621

In [14]:
df4 = pd.concat([df1,df2],axis=1)

In [15]:
df4

          A         B         C         A         B         C
0  1.999303  0.422327  0.075275  0.932062  0.481490  1.437469
1  0.395086 -1.102405 -0.589537  0.324137 -0.065409  0.293048
2  0.620258 -0.994981 -0.975683 -0.677609  0.048074  0.791621
3  0.762400 -0.472401  0.610200       NaN       NaN       NaN

In [16]:
df4.columns=list("ABCDEF")

In [17]:
df4

          A         B         C         D         E         F
0  1.999303  0.422327  0.075275  0.932062  0.481490  1.437469
1  0.395086 -1.102405 -0.589537  0.324137 -0.065409  0.293048
2  0.620258 -0.994981 -0.975683 -0.677609  0.048074  0.791621
3  0.762400 -0.472401  0.610200       NaN       NaN       NaN